date12-03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>2012年3月の記録</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="2012年3月の記録"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-12 10:52:13 JST"/>
<meta name="author" content="Yuuhi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org-mode.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">2012年3月の記録</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 10日</a>
<ul>
<li><a href="#sec-1-1">1.1 EmacsにHaskellモード導入した</a></li>
<li><a href="#sec-1-2">1.2 Emacs org-modeのTips</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 C-u×3 Tabで全展開</a></li>
<li><a href="#sec-1-2-2">1.2.2 org-modeからのHTMLなどへのエクスポートのオプション</a></li>
<li><a href="#sec-1-2-3">1.2.3 About code highlight by org-mode</a></li>
<li><a href="#sec-1-2-4">1.2.4 org-modeでのHTML出力</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 AOJメモ</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Scannerクラスの振る舞いまとめ</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 自作コマンドを~/local/&hellip;のディレクトリで管理している</a></li>
</ul>
</li>
<li><a href="#sec-2">2 11日</a>
<ul>
<li><a href="#sec-2-1">2.1 雑記</a></li>
</ul>
</li>
<li><a href="#sec-3">3 12日</a>
<ul>
<li><a href="#sec-3-1">3.1 Emacsのorg-mode</a></li>
<li><a href="#sec-3-2">3.2 雑記</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 休学を考えている</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 10日</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> EmacsにHaskellモード導入した</h3>
<div class="outline-text-3" id="text-1-1">


<p>
参考: 
Haskell-mode for Emacs<br/>
 <a href="http://projects.haskell.org/haskellmode-emacs/">http://projects.haskell.org/haskellmode-emacs/</a>
</p>
<p>
以下のソースを.emacsに
</p>


<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">haskell</span>
(add-to-list 'load-path <span style="color: #ffa07a;">"~/.emacs.d/elisp/haskell-mode-2.8.0/"</span>)
<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(load-library "haskell-site-file")</span>

<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">enscript scheme</span>
(setq auto-mode-alist
  (append auto-mode-alist
    '((<span style="color: #ffa07a;">"\\.[hg]s$"</span>  . haskell-mode)    
      (<span style="color: #ffa07a;">"\\.hi$"</span>     . haskell-mode)
      (<span style="color: #ffa07a;">"\\.l[hg]s$"</span> . literate-haskell-mode))))

(autoload 'haskell-mode <span style="color: #ffa07a;">"haskell-mode"</span>
          <span style="color: #ffa07a;">"Major mode for editing Haskell scripts."</span> t)
(autoload 'literate-haskell-mode <span style="color: #ffa07a;">"haskell-mode"</span>
          <span style="color: #ffa07a;">"Major mode for editing literate Haskell scripts."</span> t)

(add-hook 'haskell-mode-hook 'turn-on-haskell-doc-mode)
<span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(add-hook 'haskell-mode-hook 'turn-on-haskell-indentation)</span>
(add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
<span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(add-hook 'haskell-mode-hook 'turn-on-haskell-simple-indent)</span>
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Emacs org-modeのTips</h3>
<div class="outline-text-3" id="text-1-2">



</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> C-u×3 Tabで全展開</h4>
<div class="outline-text-4" id="text-1-2-1">


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> org-modeからのHTMLなどへのエクスポートのオプション</h4>
<div class="outline-text-4" id="text-1-2-2">

<p><a href="http://hpcgi1.nifty.com/spen/index.cgi?OrgMode/Manual4#i12">http://hpcgi1.nifty.com/spen/index.cgi?OrgMode%2FManual4#i12</a>
</p>
<p>
C-c C-e t       エクスポートのオプションのテンプレートを挿入します。
</p>
<p>
無効化の仕方が分からないため2回 # を挿入している
</p>


<pre class="example"># #+TITLE:     the title to be shown (default is the buffer name)
# #+AUTHOR:    the author (default taken from user-full-name)
# #+EMAIL:     his/her email address (default from user-mail-address)
# #+LANGUAGE:  language for HTML, e.g. `en' (org-export-default-language)
# #+TEXT:      Some descriptive text to be inserted at the beginning.
# #+TEXT:      Several lines may be given.
# #+OPTIONS:   H:2  num:t  toc:t  \n:nil  @:t  ::t  |:t  ^:t  *:nil  TeX:t LaTeX:t

# #+TITLE:    表示されているタイトル（デフォルトはバッファ名）
# #+AUTHOR:   作成者（デフォルトはユーザーのフルネーム）
# #+EMAIL:    Ｅメールアドレス（デフォルトはユーザーメールアドレス）
# #+LANGUAGE: ＨＴＭＬの言語。例"en"（デフォルトはorg-export-default-language)
# #+TEXT:     文頭に挿入する何らかの記述
# #+TEXT:     複数行つける場合は各行につける
# #+OPTIONS:  H:2  num:t  toc:t  \n:nil  @:t  ::t  |:t  ^:t  *:nil  TeX:t LaTeX:t
#            というオプション（次項で説明）
</pre>


</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> About code highlight by org-mode</h4>
<div class="outline-text-4" id="text-1-2-3">

<p>&lt;s Tab でbegin_srcを挿入することができる．
</p>
</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> org-modeでのHTML出力</h4>
<div class="outline-text-4" id="text-1-2-4">

<p>本ページはemacs org-modeによって生成されたHTMLを使っている．
ショートカットは"C-c C-e b"．
</p>
</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> AOJメモ</h3>
<div class="outline-text-3" id="text-1-3">

<p>AOJのJavaでSubmitするときにはMainというクラス名で
</p>

</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Scannerクラスの振る舞いまとめ</h4>
<div class="outline-text-4" id="text-1-3-1">






<pre class="example">- java.lang.Object
  +- java.util.Scanner

- public final class Scanner extends Object implements Iterator&lt;String&gt;
</pre>

<p>
キーボードからの入力を受け付けるときは以下のように記述する
</p>



<pre class="src src-java"><span style="color: #00ffff;">import</span> <span style="color: #7fffd4;">java</span>.<span style="color: #7fffd4;">util</span>.<span style="color: #98fb98;">Scanner</span>;
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">...</span>
<span style="color: #98fb98;">Scanner</span> <span style="color: #eedd82;">scan</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Scanner</span>(System.in);
</pre>


</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 自作コマンドを~/local/&hellip;のディレクトリで管理している</h3>
<div class="outline-text-3" id="text-1-4">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 11日</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 雑記</h3>
<div class="outline-text-3" id="text-2-1">

<p>朝まではorg-modeの使い方やHaskellについて調べていた．
昼過ぎからVBを書く予定であったが，起きると月曜であった．
良くないことをしてしまったと思う．
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 12日</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Emacsのorg-mode</h3>
<div class="outline-text-3" id="text-3-1">

<p>相変わらず，ソースコードへの色の着け方が分からないため，
begin_srcではなbegin_exampleを使っている．
この辺，どういう風にemacslispいじれば良いかなど分かる人がいらっしゃったらhelp．
<br/>
<br/>
</p>
<p>
あとはやはりorg-modeで生成されたHTMLだけでは見づらいため早くCSSに手をつける．
具体的には今日の夕方に．
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 雑記</h3>
<div class="outline-text-3" id="text-3-2">

<p>女装用品を少し買った．ウィッグや，つけまつげ，スカートやスポーツブラなど．
試着してみるがかわいいとはほど遠くて，まぁ予想通りなのだけど，まぁがっかりした．
まぁこっちはわりとどうでも良いことである．
</p>

</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> 休学を考えている</h4>
<div class="outline-text-4" id="text-3-2-1">

<p>まず気になるのは金のことだ．奨学金は当然止まるし，復活できるとも限らない(下記URL参照<br/>
<a href="http://www.jasso.go.jp/taiyochu/idou/kyuusi.html">http://www.jasso.go.jp/taiyochu/idou/kyuusi.html</a>
</p>
<p>
当然，一年間はバイト漬けになるわけだが，バイトをするために休学するのでは本末転倒である．
休学カードもあまり良くないのなら途方に暮れる．<br/>
現状で何かこれっていえる製作ソフトウェアの無い私ではロクな就職先は期待できない．
</p>
<p>
あと，仕事で書いているVBプログラムの方も手をつけなければならない．進捗が遅い．
</p>



</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-12 10:52:13 JST</p>
<p class="author">Author: Yuuhi</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
